export const articlesData = [
    {
        id: 1,
        title: "نکست چیست و چرا نکست ؟؟",
        disc: "Next.js یک فریمورک React است که بهینه‌سازی‌های مختلفی روی اپلیکیشن‌های ری‌اکت اعمال می‌کند. ایده اصلی خلق چنین فریمورکی این بوده است که اطمینان یابیم اپلیکیشن ما با بالاترین عملکرد ممکن آغاز شده و باقی می‌ماند. بهینه‌سازی‌های زیادی وجود دارند که می‌توان به اپلیکیشن‌های ری‌اکت اضافه کرد و اغلب آن‌ها از سوی Next.js ارائه می‌شوند. در این مقاله به جمع‌بندی مقالات آموزش Next.js مجله فرادرس پرداخته‌ایم.",
        date: "1404/04/15",
        image: "/Image/Article/Next.webp"
    },
    {
        id: 2,
        title: "همه چیز درباره تیلویند سی اس اس :))",
        disc: "در مقالات قبلی وب سایت صعود به طور کلی و جامع در رابطه با CSS و کاربرد آن در ساخت صفحات وب صحبت کردیم در این مطلب می خواهیم در رابطه با اولین فریم ورک ارائه شده برای زبان CSS یعنی Tailwind CSS توضیح دهیم، و به بررسی نکات مهم این فریم ورک یعنی Tailwind CSS بپردازیم. پس اگر می خواهید در رابطه با موضوع Tailwind CSS چیست ؟ همه چیز درباره تیلویند سی اس اس اطلاعات با ارزشی کسب کنید در این مطلب ما را همراهی کنید. پیشنهاد کارشناسان گروه آموزش برنامه نویسی صعود این است که حتما قبل از خواندن این مقاله، مقالات CSS چیست؟ آشنایی با زبان سی اس اس و بهترین کتاب های آموزشی زبان HTML/CSS در جهان را مطالعه کنید.",
        date: "1404/04/20",
        image: "/Image/Article/Tailwind.webp"
    },
    {
        id: 3,
        title: "معماری ماژولار در پروژه های ری اکت !",
        disc: "تا حالا برات پیش اومده وسط یه پروژه ری اکت، بعد چند ماه کدنویسی، وقتی دنبال یه کامپوننت ساده میگردی، حس کنی توی یه جنگل تاریک و پر از پوشه و فایل گم شدی؟ این دقیقا همون جاییه که معماری ماژولار میاد به...",
        date: "1404/05/10",
        image: "/Image/Article/React.webp"
    },
]

