export const articlesData = [
    {
        id: 1,
        title: "فریلنسری چیست؟ راهنمای کامل شروع فریلنسری + درآمد و مهارت‌ها",
        disc: "تصور کنید هر روز صبح با انرژی و آزادی کامل سر کار بروید، خودتان ساعت کاری‌تان را مشخص کنید و پروژه‌هایی را انتخاب نمایید که واقعا به آن‌ها علاقه دارید! در این حالت باید بگوییم که شما می‌خواهید یک فریلنسر شوید! اما فریلنسری چیست؟ فریلنسری نوعی کار مستقل است که در آن فرد بدون وابستگی به یک کارفرمای ثابت، خدمات یا مهارت‌های خود را به صورت پروژه‌ای ارائه می‌دهد و درآمد خود را به‌صورت مستقیم از مشتری دریافت می‌کند. در ادامه این مقاله از مجله سبزلرن قصد داریم علاوه‌بر بیان دقیق مفهوم فریلنسری، شما را با مزایا و معایب این روش کار کردن هم بیشتر آشنا کنیم.",
        date: "1404/10/18",
        image: "/Image/Article/FreeLanser.webp",
        alt: "React",

        Description: [
            {
                id: 1,
                disc: "تصور کنید هر روز صبح با انرژی و آزادی کامل سر کار بروید، خودتان ساعت کاری‌تان را مشخص کنید و پروژه‌هایی را انتخاب نمایید که واقعا به آن‌ها علاقه دارید! در این حالت باید بگوییم که شما می‌خواهید یک فریلنسر شوید! اما فریلنسری چیست؟ فریلنسری نوعی کار مستقل است که در آن فرد بدون وابستگی به یک کارفرمای ثابت، خدمات یا مهارت‌های خود را به صورت پروژه‌ای ارائه می‌دهد و درآمد خود را به‌صورت مستقیم از مشتری دریافت می‌کند. در ادامه این مقاله از مجله سبزلرن قصد داریم علاوه‌بر بیان دقیق مفهوم فریلنسری، شما را با مزایا و معایب این روش کار کردن هم بیشتر آشنا کنیم.",
            },
            {
                id: 2,
                disc: "برای کسانی‌که نمی‌دانند فریلنسری چیست باید بگوییم که فریلنسری (Freelancing) به معنای آزادکاری است و فریلنسر (Freelancer) کسی است که خود اشتغال بوده و لزوما تعهد بلندمدتی به یک شرکت یا مجموعه ندارد. فریلنسرها می‌توانند به‌صورت مستقل یا از طریق معرفی شرکت‌ها و موسسات فعالیت کنند و نحوه همکاری‌شان متنوع است!",
            },
            {
                id: 3,
                disc: "برخی قرارداد رسمی دارند و برخی به‌صورت آزاد و حتی رایگان برای کسب تجربه یا شهرت کار می‌کنند. دستمزد فریلنسرها بسته به مهارت، تجربه و نوع پروژه ممکن است ساعتی، روزانه، مرحله‌ای یا کل پروژه پرداخت شود و حتی پیش‌پرداخت یا بیعانه نیز دریافت می‌کنند. فریلنسینگ در حوزه‌های مختلفی مانند نویسندگی، ویراستاری، طراحی، برنامه‌نویسی، موسیقی، تصویرگری و تولید محتوا کاربرد دارد و تفاوت اصلی آن با پیمانکاری در استقلال و آزادی عمل فریلنسر در خلق و ارائه آثار یا خدمات است.",
            },
            {
                id: 4,
                disc: "فریلنسر یا آزادکار کسی است که بدون تعهد به یک سازمان یا شرکت مشخص، خدمات حرفه‌ای و تخصصی خود را به مجموعه‌ها و کارفرماهای مختلف ارائه و بسته به پروژه‌ها، کارفرمای خود را تغییر می‌دهد. ریشه واژه «فری‌لنس» به معنای «نیزه آزاد» بازمی‌گردد و در گذشته به کسانی گفته می‌شد که بدون تعهد به یک کشور یا حاکم مشخص، برای هر کسی‌که پول می‌داد می‌جنگیدند، اما فریلنسینگ مدرن به شکل کار مستقل و پروژه‌ای حدود یک قرن قدمت دارد.",
            },
            {
                id: 5,
                disc: "این سبک همکاری باعث می‌شود فریلنسر بتواند هم‌زمان با چند مجموعه کار کند و دستمزد ساعتی یا پروژه‌ای او معمولا بالاتر از حقوق ثابت کارکنان مشابه است، چون نوسان در تعداد پروژه‌ها و زمان‌بندی کار را پوشش می‌دهد. ",
            },
            {
                id: 6,
                disc: "اگر از کارهای یکنواخت خسته می‌شوید و به‌دنبال آزادی بیشتر در مسیر شغلی خود هستید، می‌توانید مسیر فریلنسری را امتحان کنید. این سبک کار برای افرادی مناسب است که از یکنواختی شغل‌های ثابت خسته شده‌اند، مهارت‌های خاصی در زمینه‌های هنری، علمی یا فنی دارند یا می‌خواهند هم‌زمان در چند پروژه و با چند کارفرما همکاری کنند. همچنین کسانی‌که می‌خواهند زمان و مکان کار خود را کنترل کنند، فرصت یادگیری مهارت‌های جدید داشته باشند و دستمزد خود را به‌صورت مستقیم از پروژه‌ها دریافت کنند، می‌توانند به‌راحتی وارد دنیای آزادکاری یا فریلنسینگ (Freelancing) شوند.",
            },

        ]
    },

    {
        id: 2,
        title: "سیستم باینری چیست؟ پایه‌ای‌ترین مفهوم دنیای کامپیوتر",
        disc: "در حالت عادی، هیچ دستگاه دیجیتالی توانایی فهم زبان انسان‌ها را ندارد. فارسی، انگلیسی، عربی، پرتغالی، چینی، روسی و سایر زبان‌هایی که انسان‌ها با آن صحبت می‌کنند، همگی زبان‌های انسانی هستند. برای ارتباط با ماشین‌ها یا هر قطعه، دستگاه یا سیستم دیجیتالی، باید از زبان قابل فهم توسط ماشین استفاده شود. به این زبان، باینری یا دودویی می‌گوییم! زبانی که تنها از دو جزء تشکیل شده: 0 و 1! همه اطلاعاتی که در رایانه یا موبایل خود دارید، از تصاویر گرفته تا صوت‌ها، ویدیوها، بازی‌ها و حتی پیامک‌هایی که به دوستان خود می‌فرستید، همگی به صورت اعداد باینری ذخیره می‌شود. ",
        date: "1404/10/18",
        image: "/Image/Article/Binary.webp",
        alt: "Binary",

        Description: [
            {
                id: 1,
                disc: "در حالت عادی، هیچ دستگاه دیجیتالی توانایی فهم زبان انسان‌ها را ندارد. فارسی، انگلیسی، عربی، پرتغالی، چینی، روسی و سایر زبان‌هایی که انسان‌ها با آن صحبت می‌کنند، همگی زبان‌های انسانی هستند. برای ارتباط با ماشین‌ها یا هر قطعه، دستگاه یا سیستم دیجیتالی، باید از زبان قابل فهم توسط ماشین استفاده شود. به این زبان، باینری یا دودویی می‌گوییم! زبانی که تنها از دو جزء تشکیل شده: 0 و 1! همه اطلاعاتی که در رایانه یا موبایل خود دارید، از تصاویر گرفته تا صوت‌ها، ویدیوها، بازی‌ها و حتی پیامک‌هایی که به دوستان خود می‌فرستید، همگی به صورت اعداد باینری ذخیره می‌شود. ",
            },
            {
                id: 2,
                disc: "پایه‌ای‌ترین ابزار برای شمارش، تعداد انگشتان انسان است. از آنجایی که انسان‌ها دارای 10 انگشت هستند، سیستم شمارش آنها نیز بر مبنای 10 است. این سیستم را با نام سیستم اعداد ده‌دهی یا دسیمال (Decimal) می‌شناسیم. برای مثال، در دوران دبستان به کودکان شمارش بر مبنای 10 به صورت واحدهای یکان، دهگان، صدگان، هزارگان و… آموزش داده می‌شود تا با استفاده از آن، بتوانند اعداد را تشخیص داده و آنها را براساس سیستم ده‌دهی تعریف کنند. ",
            },
            {
                id: 3,
                disc: "اما ماشین‌ها با همان تجهیزات دیجیتالی، نه دارای انگشت هستند و نه می‌توانند به تنهایی، شمارش را انجام دهند. آنها دارای مدارهای الکتریکی هستند که تنها دو حالت ممکن دارند: خاموش و روشن! به همین دلیل، سیستم اعداد استفاده شده در ماشین‌ها باید بر مبنای 2 باشد که به آن سیستم دودویی یا باینری گفته می‌شود. کل محاسبات انجام شده توسط رایانه‌ها، در واقع همین اعداد 0 و 1 هستند که در حافظه آنها ذخیره شده‌اند. اگر ترانزیستور خاموش باشد، عدد 0 و اگر روشن باشد، عدد 1 در حافظه ذخیره می‌شود. ",
            },
            {
                id: 4,
                disc: "سیستم دودویی یا باینری، ساده‌ترین و بنیادی‌ترین روش نمایش اطلاعات در دنیای دیجیتال است. برخلاف انسان‌ها که از ده رقم (0 تا 9) برای شمارش استفاده می‌کنند، کامپیوترها فقط با دو رقم 0 و 1 کار می‌کنند. علت استفاده از سیستم باینری، این است که ساختار فیزیکی کامپیوتر بر پایه جریان برق عمل می‌کند و هر مدار تنها می‌تواند در یکی از دو حالت روشن یا خاموش باشد. این دو حالت با اعداد 1 (روشن) و 0 (خاموش) نمایش داده می‌شوند.",
            },
            {
                id: 5,
                disc: "تجهیزات دیجیتال دارای یک مغز پردازشی به نام CPU هستند که روی برد اصلی دستگاه نصب می‌شود. هر پردازنده دارای میلیاردها واحد پردازشی بسیار کوچک به نام ترانزیستور است. ترانزیستور را می‌توان “کوچک‌ترین جزء منطقی” درون پردازنده دانست. این قطعه می‌تواند جریان برق را عبور دهد یا قطع کند. وقتی جریان عبور می‌کند، مدار در حالت روشن است و کامپیوتر آن را به صورت عدد 1 می‌شناسد. وقتی جریان عبور نمی‌کند، مدار در حالت خاموش است و کامپیوتر آن را به صورت عدد 0 تفسیر می‌کند. به این صورت، کامپیوترها می‌توانند هر نوع اطلاعات را نمایش دهند. از اعداد ساده در مبنای 10 گرفته تا حروف، تصاویر، ویدیوها، کارهای انجام شده توسط موس و کیبورد و هرکاری که تجهیزات دیجیتالی قادر به انجام آنها هستند! ",
            },
            {
                id: 6,
                disc: "اگر از کارهای یکنواخت خسته می‌شوید و به‌دنبال آزادی بیشتر در مسیر شغلی خود هستید، می‌توانید مسیر فریلنسری را امتحان کنید. این سبک کار برای افرادی مناسب است که از یکنواختی شغل‌های ثابت خسته شده‌اند، مهارت‌های خاصی در زمینه‌های هنری، علمی یا فنی دارند یا می‌خواهند هم‌زمان در چند پروژه و با چند کارفرما همکاری کنند. همچنین کسانی‌که می‌خواهند زمان و مکان کار خود را کنترل کنند، فرصت یادگیری مهارت‌های جدید داشته باشند و دستمزد خود را به‌صورت مستقیم از پروژه‌ها دریافت کنند، می‌توانند به‌راحتی وارد دنیای آزادکاری یا فریلنسینگ (Freelancing) شوند.",
            },

        ]
    },

    {
        id: 3,
        title: "React بهتر است یا Next ?!",
        disc: "اگر در دنیای برنامه‌ نویسی فرانت‌اند قدم گذاشته باشید، احتمالاً نام “React” و “Next” زیاد به گوشتان خورده. دو کتابخانه و فریم‌ورک محبوب که هر دو با هدف ساخت رابط‌های کاربری مدرن به وجود آمده‌اند، اما هر کدام با فلسفه و توانمندی‌های خاص خود. شاید در ابتدا همه‌چیز شبیه به هم به نظر برسه، اما وقتی وارد جزئیات می‌شویم، تفاوت‌هایی پیدا می‌کنیم که می‌توانند مسیر یک پروژه یا حتی مسیر حرفه‌ای یک برنامه‌نویس را تغییر دهند!",
        date: "1404/10/18",
        image: "/Image/Article/NextVsReact.webp",
        alt: "NextVsReact",

        Description: [
            {
                id: 1,
                disc: "اگر در دنیای برنامه‌ نویسی فرانت‌اند قدم گذاشته باشید، احتمالاً نام “React” و “Next” زیاد به گوشتان خورده. دو کتابخانه و فریم‌ورک محبوب که هر دو با هدف ساخت رابط‌های کاربری مدرن به وجود آمده‌اند، اما هر کدام با فلسفه و توانمندی‌های خاص خود. شاید در ابتدا همه‌چیز شبیه به هم به نظر برسه، اما وقتی وارد جزئیات می‌شویم، تفاوت‌هایی پیدا می‌کنیم که می‌توانند مسیر یک پروژه یا حتی مسیر حرفه‌ای یک برنامه‌نویس را تغییر دهند!",
            },
            {
                id: 2,
                disc: "React JS یکی از محبوب‌‌ترین کتابخانه‌های جاوا اسکریپت است که شکل‌گیری و توسعه آن توسط تیم فیس‌بوک (Meta امروزی) انجام شده است. این کتابخانه خیلی زود تبدیل به انتخاب اول برنامه‌نویسان برای ساخت رابط‌های کاربری مدرن و تعاملی شد. بسیاری از اپلیکیشن‌ها و سایت‌های معروف از جمله “Instagram”، “Netflix” و “Airbnb” نیز با React ساخته شده‌اند. اما سوال اصلی این‌که چه چیزی React را تا این اندازه خاص کرده است؟",
            },
            {
                id: 3,
                disc: "Next JS در واقع یک فریم‌‌ورک مبتنی بر React است که با هدف ساده‌‌تر کردن فرایند ساخت اپلیکیشن‌های وب بهینه و سریع ایجاد شده است. شرکت Vercel پشت این فریم‌ ورک قرار دارد و در چند سال اخیر توانسته توجه بسیار زیادی را از جامعه برنامه‌نویسان به سمت خودش جلب کند! اما شاید بپرسید وقتی React وجود دارد و کارش را به‌خوبی انجام می‌دهد، چرا باید سراغ Next JS رفت؟",
            },
            {
                id: 4,
                disc: "واقعیت این است که React هرچقدر هم که قدرتمند باشد، در پروژه‌های پیچیده‌تر و به‌خصوص در بحث SEO (بهینه‌سازی برای موتورهای جستجو) با محدودیت‌هایی مواجه می‌شود. در چنین شرایطی Next JS دقیقاً همان چیزی است که به آن نیاز دارید. این فریم‌ورک با ارائه ویژگی‌هایی مثل «رندر سمت سرور» (Server-side Rendering یا SSR)، «تولید سایت‌های استاتیک» (Static Site Generation یا SSG) و «تولید مجدد تدریجی صفحات» (Incremental Static Regeneration یا ISR) آمده تا مشکلاتی را حل کند که React به‌تنهایی قادر به حل آن‌ها نیست!",
            },
            {
                id: 5,
                disc: "یکی از ویژگی‌های مهم Next JS سیستم مسیریابی (Routing) داخلی آن است که از همان ابتدا در دسترس قرار دارد و نیاز به استفاده از کتابخانه‌های جانبی مثل “React Router” را به‌طور کامل از بین می‌برد. علاوه‌بر این، Next JS امکانات فوق‌العاده‌ای برای مدیریت تصاویر، بهینه‌سازی خودکار صفحات و حتی اجرای آسان API‌های بک‌اند فراهم می‌کند که باعث می‌شود تمرکز شما فقط روی منطق اصلی برنامه باشد و نگران مسائل حاشیه‌ای نشوید.",
            },
            {
                id: 6,
                disc: "Next JS محبوبیتش را مدیون این است که توانسته به یک نیاز واقعی در بین برنامه‌نویسان پاسخ دهد؛ یعنی ساخت برنامه‌های وب سریع‌تر، بهینه‌تر و راحت‌تر! پروژه‌هایی مانند سایت Netflix Jobs، وبلاگ Hashcode و هزاران اپلیکیشن موفق دیگر که با Next JS ساخته شده‌اند، گواه خوبی برای اثبات این ادعا هستند.",
            },

        ]
    },

    {
        id: 4,
        title: "آیا React JS در آینده همچنان محبوب خواهد بود؟",
        disc: "اگر به دنیای برنامه‌نویسی علاقه دارید، احتمالاً نام React JS به گوشتان خورده است. این کتابخانه جاوا اسکریپت در چند سال گذشته تبدیل به یک ابزار کلیدی در توسعه وب شده و میلیون‌ها توسعه‌دهنده در سراسر جهان از آن استفاده می‌کنند. اما آیا این محبوبیت پایدار خواهد بود؟",
        date: "1404/10/18",
        image: "/Image/Article/React.jpg",
        alt: "React.js",

        Description: [
            {
                id: 1,
                disc: "اگر به دنیای برنامه‌نویسی علاقه دارید، احتمالاً نام React JS به گوشتان خورده است. این کتابخانه جاوا اسکریپت در چند سال گذشته تبدیل به یک ابزار کلیدی در توسعه وب شده و میلیون‌ها توسعه‌دهنده در سراسر جهان از آن استفاده می‌کنند. اما آیا این محبوبیت پایدار خواهد بود؟",
            },
            {
                id: 2,
                disc: "ری اکت یک کتابخانه جاوا اسکریپت متن‌ باز است که در سال ۲۰۱۳ توسط فیسبوک معرفی شد. هدف اصلی آن ساده‌سازی فرآیند ساخت رابط‌های کاربری پویا و واکنش‌گراست. React به توسعه‌دهندگان این امکان را می‌دهد که با استفاده از کامپوننت‌ها، رابط‌های کاربری مدولار و قابل استفاده مجدد بسازند.",
            },
            {
                id: 3,
                disc: "React از یک فناوری به نام DOM مجازی (Virtual DOM) استفاده می‌کند که باعث افزایش کارایی برنامه می‌شود. به‌جای بروزرسانی مستقیم DOM اصلی، React ابتدا تغییرات را در یک نسخه مجازی شبیه‌سازی کرده و سپس تنها بخش‌های تغییر یافته را به DOM واقعی اعمال می‌کند. این فرآیند سرعت بارگذاری و عملکرد برنامه را بهبود می‌بخشد",
            },
            {
                id: 4,
                disc: "برخلاف فریم ورک‌ های دیگر که اغلب دارای ساختارهای از پیش تعیین‌شده هستند، React آزادی بیشتری به توسعه‌ دهندگان می‌دهد. شما می‌توانید از React در پروژه‌های کوچک یا حتی اپلیکیشن‌های پیچیده استفاده کنید و به‌راحتی آن را با سایر ابزارها و کتابخانه‌ها ترکیب کنید.",
            },
            {
                id: 5,
                disc: "با یادگیری React، شما می‌توانید از دانش خود برای توسعه اپلیکیشن‌های موبایل با React Native نیز استفاده کنید. این قابلیت، محبوبیت React را به سطح جدیدی رسانده است، چرا که توسعه‌دهندگان وب و موبایل می‌توانند از یک منبع دانش مشترک استفاده کنند.",
            },
        ]
    },
]

