import { FaTelegram } from "react-icons/fa";
import { FaGithub } from "react-icons/fa";
import { FaInstagram } from "react-icons/fa";
import { FaWhatsapp } from "react-icons/fa";


const contactMeData = [
    { id: 1, title: 'تلگرام', disc: "0914-545-0730", icon: <FaTelegram /> },
    { id: 3, title: 'واتساپ', disc: "0914-545-0730", icon: <FaWhatsapp /> },
    { id: 2, title: 'انیستاگرام', disc: "mohsenical", icon: <FaInstagram /> },
    { id: 4, title: 'گیت هاب', disc: "mohsenical", icon: <FaGithub /> },
]

const accordionData = [
    {
        id: 1,
        title: "طراحی سایت چقدر زمان می‌برد ؟!",
        content: "پاسخ: زمان طراحی سایت بستگی به پیچیدگی پروژه، تعداد صفحات و امکانات مورد نیاز دارد. یک سایت شرکتی ساده معمولاً 2-4 هفته، سایت فروشگاهی 4-8 هفته و پروژه‌های سفارشی پیچیده ممکن است 2-3 ماه زمان ببرد. پس از تحلیل نیازهای شما، زمان‌بندی دقیق ارائه می‌شود."
    },
    {
        id: 2,
        title: "هزینه طراحی سایت چقدر است ؟!",
        content: "پاسخ: هزینه بستگی به نوع سایت, امکانات و نیاز های شما مشخص میشود; برای قیمت پس از مشاوره و جلسه و برسی نوع سایت پیشنهاد ارسال میشود"
    },
    {
        id: 3,
        title: "آیا سایت من ریسپانیسو خواهد بود ؟!",
        content: "پاسخ: بله تمامی سایت ها کاملا واکنش گرا طراحی میشوند تا در موبایل تبلت و دسکتاب بهینه باشد :))"
    },
    {
        id: 4,
        title: "آیا پس از تحویل, سایت پشتیبانی دارد ؟!",
        content: "پاسخ: بله پشتیبانی و نگه داری سایت شامل رفع خطاها و آبدیت های دوره است"
    },
    {
        id: 5,
        title: "میتوانم تغییرات دلخواه خودم را روی سایت اعمال کنم ؟!",
        content: "پاسخ: بله سایت طوری طراحی میشود که شما بتوانید به راحتی محتوا و بعضی بخش هارا مدیریت کنید"
    },
    {
        id: 6,
        title: "چطور میتوانم پروژه را شروع کنم ؟!",
        content: "پاسخ: با ارسال پیام از فرم تماس یا استفاده از پیام رسان های تلگرام یا انیستا یا خود گوشی که هم شماره هم ID در بالا نوشته شده است با من ارتباط بگیرید"
    },
]

export { contactMeData, accordionData }